MikroElektronika/core_packages/ARM/gcc_clang/system/src/sam/atsamrh71/thirdparty/atsamrh71/component/pwm.h
#define PWM_ISR1_CHID_Pos                     _U_(0)                                               /**< (PWM_ISR1 Position) Counter Event on Channel x */
#define PWM_ISR1_CHID_Msk                     (_U_(0xF) << PWM_ISR1_CHID_Pos)                      /**< (PWM_ISR1 Mask) CHID */
#define PWM_ISR1_CHID(value)                  (PWM_ISR1_CHID_Msk & ((value) << PWM_ISR1_CHID_Pos)) 
#define PWM_ISR1_FCHID_Pos                    _U_(16)                                              /**< (PWM_ISR1 Position) Fault Protection Trigger on Channel 3 */
#define PWM_ISR1_FCHID_Msk                    (_U_(0xF) << PWM_ISR1_FCHID_Pos)                     /**< (PWM_ISR1 Mask) FCHID */
#define PWM_ISR1_FCHID(value)                 (PWM_ISR1_FCHID_Msk & ((value) << PWM_ISR1_FCHID_Pos)) 

/* -------- PWM_SCM : (PWM Offset: 0x20) (R/W 32) PWM Sync Channels Mode Register -------- */
#define PWM_SCM_SYNC0_Pos                     _U_(0)                                               /**< (PWM_SCM) Synchronous Channel 0 Position */
#define PWM_SCM_SYNC0_Msk                     (_U_(0x1) << PWM_SCM_SYNC0_Pos)                      /**< (PWM_SCM) Synchronous Channel 0 Mask */
#define PWM_SCM_SYNC0(value)                  (PWM_SCM_SYNC0_Msk & ((value) << PWM_SCM_SYNC0_Pos))
#define PWM_SCM_SYNC1_Pos                     _U_(1)                                               /**< (PWM_SCM) Synchronous Channel 1 Position */
#define PWM_SCM_SYNC1_Msk                     (_U_(0x1) << PWM_SCM_SYNC1_Pos)                      /**< (PWM_SCM) Synchronous Channel 1 Mask */
#define PWM_SCM_SYNC1(value)                  (PWM_SCM_SYNC1_Msk & ((value) << PWM_SCM_SYNC1_Pos))
#define PWM_SCM_SYNC2_Pos                     _U_(2)                                               /**< (PWM_SCM) Synchronous Channel 2 Position */
#define PWM_SCM_SYNC2_Msk                     (_U_(0x1) << PWM_SCM_SYNC2_Pos)                      /**< (PWM_SCM) Synchronous Channel 2 Mask */
#define PWM_SCM_SYNC2(value)                  (PWM_SCM_SYNC2_Msk & ((value) << PWM_SCM_SYNC2_Pos))
#define PWM_SCM_SYNC3_Pos                     _U_(3)                                               /**< (PWM_SCM) Synchronous Channel 3 Position */
#define PWM_SCM_SYNC3_Msk                     (_U_(0x1) << PWM_SCM_SYNC3_Pos)                      /**< (PWM_SCM) Synchronous Channel 3 Mask */
#define PWM_SCM_SYNC3(value)                  (PWM_SCM_SYNC3_Msk & ((value) << PWM_SCM_SYNC3_Pos))
#define PWM_SCM_UPDM_Pos                      _U_(16)                                              /**< (PWM_SCM) Synchronous Channels Up2025-05-20 Mode Position */
#define PWM_SCM_UPDM_Msk                      (_U_(0x3) << PWM_SCM_UPDM_Pos)                       /**< (PWM_SCM) Synchronous Channels Up2025-05-20 Mode Mask */
#define PWM_SCM_UPDM(value)                   (PWM_SCM_UPDM_Msk & ((value) << PWM_SCM_UPDM_Pos))  
#define   PWM_SCM_UPDM_MODE0_Val              _U_(0x0)                                             /**< (PWM_SCM) Manual write of double buffer registers and manual up2025-05-20 of synchronous channels  */
#define   PWM_SCM_UPDM_MODE1_Val              _U_(0x1)                                             /**< (PWM_SCM) Manual write of double buffer registers and automatic up2025-05-20 of synchronous channels  */
#define   PWM_SCM_UPDM_MODE2_Val              _U_(0x2)                                             /**< (PWM_SCM) Automatic write of duty-cycle up2025-05-20 registers by the DMA Controller and automatic up2025-05-20 of synchronous channels  */
#define PWM_SCM_UPDM_MODE0                    (PWM_SCM_UPDM_MODE0_Val << PWM_SCM_UPDM_Pos)         /**< (PWM_SCM) Manual write of double buffer registers and manual up2025-05-20 of synchronous channels Position  */
#define PWM_SCM_UPDM_MODE1                    (PWM_SCM_UPDM_MODE1_Val << PWM_SCM_UPDM_Pos)         /**< (PWM_SCM) Manual write of double buffer registers and automatic up2025-05-20 of synchronous channels Position  */
#define PWM_SCM_UPDM_MODE2                    (PWM_SCM_UPDM_MODE2_Val << PWM_SCM_UPDM_Pos)         /**< (PWM_SCM) Automatic write of duty-cycle up2025-05-20 registers by the DMA Controller and automatic up2025-05-20 of synchronous channels Position  */
#define PWM_SCM_PTRM_Pos                      _U_(20)                                              /**< (PWM_SCM) DMA Controller Transfer Request Mode Position */
#define PWM_SCM_PTRM_Msk                      (_U_(0x1) << PWM_SCM_PTRM_Pos)                       /**< (PWM_SCM) DMA Controller Transfer Request Mode Mask */
#define PWM_SCM_PTRM(value)                   (PWM_SCM_PTRM_Msk & ((value) << PWM_SCM_PTRM_Pos))  
#define PWM_SCM_PTRCS_Pos                     _U_(21)                                              /**< (PWM_SCM) DMA Controller Transfer Request Comparison Selection Position */
#define PWM_SCM_PTRCS_Msk                     (_U_(0x7) << PWM_SCM_PTRCS_Pos)                      /**< (PWM_SCM) DMA Controller Transfer Request Comparison Selection Mask */
#define PWM_SCM_PTRCS(value)                  (PWM_SCM_PTRCS_Msk & ((value) << PWM_SCM_PTRCS_Pos))
#define PWM_SCM_Msk                           _U_(0x00F3000F)                                      /**< (PWM_SCM) Register Mask  */

#define PWM_SCM_SYNC_Pos                      _U_(0)                                               /**< (PWM_SCM Position) Synchronous Channel x */
#define PWM_SCM_SYNC_Msk                      (_U_(0xF) << PWM_SCM_SYNC_Pos)                       /**< (PWM_SCM Mask) SYNC */
#define PWM_SCM_SYNC(value)                   (PWM_SCM_SYNC_Msk & ((value) << PWM_SCM_SYNC_Pos))   

/* -------- PWM_DMAR : (PWM Offset: 0x24) ( /W 32) PWM DMA Register -------- */
#define PWM_DMAR_DMADUTY_Pos                  _U_(0)                                               /**< (PWM_DMAR) Duty-Cycle Holding Register for DMA Access Position */
#define PWM_DMAR_DMADUTY_Msk                  (_U_(0xFFFFFF) << PWM_DMAR_DMADUTY_Pos)              /**< (PWM_DMAR) Duty-Cycle Holding Register for DMA Access Mask */
#define PWM_DMAR_DMADUTY(value)               (PWM_DMAR_DMADUTY_Msk & ((value) << PWM_DMAR_DMADUTY_Pos))
#define PWM_DMAR_Msk                          _U_(0x00FFFFFF)                                      /**< (PWM_DMAR) Register Mask  */


/* -------- PWM_SCUC : (PWM Offset: 0x28) (R/W 32) PWM Sync Channels Up2025-05-20 Control Register -------- */
#define PWM_SCUC_UPDULOCK_Pos                 _U_(0)                                               /**< (PWM_SCUC) Synchronous Channels Up2025-05-20 Unlock Position */
#define PWM_SCUC_UPDULOCK_Msk                 (_U_(0x1) << PWM_SCUC_UPDULOCK_Pos)                  /**< (PWM_SCUC) Synchronous Channels Up2025-05-20 Unlock Mask */
#define PWM_SCUC_UPDULOCK(value)              (PWM_SCUC_UPDULOCK_Msk & ((value) << PWM_SCUC_UPDULOCK_Pos))
#define PWM_SCUC_Msk                          _U_(0x00000001)                                      /**< (PWM_SCUC) Register Mask  */


